
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ВычисляемыеПоля = Новый Массив;
	ВычисляемыеПоля.Добавить("Имя");
	ВычисляемыеПоля.Добавить("ПолноеИмя");
	ВычисляемыеПоля.Добавить("ПользовательОС");
	Список.УстановитьОграниченияИспользованияВОтборе(ВычисляемыеПоля);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура Таблица1ПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	// Вставить содержимое обработчика.
	Для каждого Строка Из Строки Цикл
	
		СтрокаДанных = Строка.Значение.Данные;
		Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
			Новый УникальныйИдентификатор(Строка.Ключ.Код));
			
		СтрокаДанных.Имя = "";
		СтрокаДанных.ПолноеИмя = "";
		СтрокаДанных.ПользовательОС = "";

		Если Пользователь = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДанных.Имя = Пользователь.Имя;
		СтрокаДанных.ПолноеИмя = Пользователь.ПолноеИмя;
		СтрокаДанных.ПользовательОС = Пользователь.ПользовательОС;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	// Вставить содержимое обработчика.
	УстановитьПривилегированныйРежим(Истина);
	
	Для каждого Строка Из Строки Цикл
	
		СтрокаДанных = Строка.Значение.Данные;
		Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
			Новый УникальныйИдентификатор(Строка.Ключ.Код));
			
		СтрокаДанных.Имя = "";
		СтрокаДанных.ПолноеИмя = "";
		СтрокаДанных.ПользовательОС = "";

		Если Пользователь = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДанных.Имя = Пользователь.Имя;
		СтрокаДанных.ПолноеИмя = Пользователь.ПолноеИмя;
		СтрокаДанных.ПользовательОС = Пользователь.ПользовательОС;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти