Перем _Результаты Экспорт;

Функция Выгрузить() Экспорт
	
	_Результаты.Unload();
	
	КолвоКолонок = _Результаты.ColumnsCount;
	КолвоСтрок = _Результаты.RowsCount;
	
	Таблица = Новый ТаблицаЗначений;
	
	Для Индекс = 0 По КолвоКолонок - 1 Цикл
		
		ИмяКолонки = _Результаты.GetColumnName(Индекс);
		Таблица.Колонки.Добавить(ИмяКолонки,,ИмяКолонки);
		
	КонецЦикла;
	
	Для ИндексСтроки = 0 По КолвоСтрок - 1 Цикл
		
		ТекСтрока = Таблица.Добавить();
		
		Для Индекс = 0 По КолвоКолонок - 1 Цикл
		
			Значение = _Результаты.GetCellValue(ИндексСтроки, Индекс);
			
			Если _Результаты.IsBinaryData(ИндексСтроки, Индекс)Тогда
				Значение = Base64Значение(Значение);
			КонецЕсли;
			
			ТекСтрока.Установить(Индекс, Значение);
		
		КонецЦикла;
		
	КонецЦикла;
	
	_Результаты.ClearResults();
	
	Возврат Таблица;
	
КонецФункции