#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьДляWebConfig(Команда)
	СформироватьДляWebConfigНаСервере();
	Док = Новый ТекстовыйДокумент;
	
	Док.ДобавитьСтроку("<!-- Скопируйте ключ в макет, входящий в подсистему СекцияConnectionStringsФайлаWebConfig -->");
	Док.ДобавитьСтроку("");
	Док.ДобавитьСтроку("        <add name=""" + Объект.Код + """ connectionString=""" + Объект.СтрокаСоединения + """ />");
	Док.ДобавитьСтроку("");
	Док.ДобавитьСтроку("<!-- Скопируйте ключ в макет, входящий в подсистему СекцияAppSettingsФайлаWebConfig -->");
	Док.ДобавитьСтроку("");
	Док.ДобавитьСтроку("    <add key=""" + Объект.Код + """ value=""" + ПолучитьТипСУБД() + """ />");
	Док.ДобавитьСтроку("");
	
	Док.Показать(Объект.Наименование);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьДляWebConfigНаСервере()
	// Вставить содержимое обработчик
КонецПроцедуры

&НаСервере
Функция ПолучитьТипСУБД()
	
	Если Объект.ТипСУБД = Перечисления.ТипыСУБД.SQLite Тогда
		Возврат "SQLite";
	ИначеЕсли Объект.ТипСУБД = Перечисления.ТипыСУБД.MSSQLServer Тогда
		Возврат "MSSQLServer";
	ИначеЕсли Объект.ТипСУБД = Перечисления.ТипыСУБД.MySQL Тогда
		Возврат "MySQL";
	ИначеЕсли Объект.ТипСУБД = Перечисления.ТипыСУБД.PostgreSQL Тогда
		Возврат "PostgreSQL";
	Иначе
		ВызватьИсключение "Неизвестный тип СУБД";
	КонецЕсли;
		
КонецФункции

#КонецОбласти

