////////////////////////////////////////////////////////////////////////////////
// Реализация функций работы с SCP
//  
////////////////////////////////////////////////////////////////////////////////

Перем COMОбъектСоединениеSCP Экспорт; // Экземпляр COM-объекта SshDataProcessorCom.ScpCom

#Область ПрограммныйИнтерфейс
	
// Отправляет файл на удаленный сервер
//
// Параметры:
//  ПутьИсточника  - Строка - путь к файлу источника
//  ПутьНазначения  - Строка - путь на удаленном компьютере
//
Процедура ОтправитьФайл(ПутьИсточника, ПутьНазначения) Экспорт

	COMОбъектСоединениеSCP.UploadFile(ПутьИсточника, ПутьНазначения);
	
КонецПроцедуры        

// Получает файл с удаленного сервера
//
// Параметры:
//  ПутьИсточника  - Строка - путь к файлу на удаленном компьютере
//  ПутьНазначения  - Строка - путь на локальном компьютере
//
Процедура ПолучитьФайл(ПутьИсточника, ПутьНазначения) Экспорт
	
	COMОбъектСоединениеSCP.DownloadFile(ПутьИсточника, ПутьНазначения);
	
КонецПроцедуры

// Завершает соединение с удаленным сервером
//
Процедура Разорвать() Экспорт
	
	COMОбъектСоединениеSCP.Disconnect();

КонецПроцедуры

#КонецОбласти