////////////////////////////////////////////////////////////////////////////////
// Функции, упрощающие работу с клиентом SSH
//  
////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

// Выполняет команду SSH
//
// Параметры:
//  ТекстКоманды - Строка	 - текст команды
//  Соединение	 - ОбработкаОбъект.СоединениеSSHСлужебная	 - соединение SSH
//  РазорватьСоединениеПриОшибке - Булево - Если истина, при возникновении ошибки соединение разрывается.
//  По умолчанию - Истина.
//  Кодировка	 - Строка	 - Кодировка текста соединения. По умолчанию - UTF-8
// 
// Возвращаемое значение:
//   - 
//
Функция ВыполнитьКоманду(ТекстКоманды, Соединение, РазорватьСоединениеПриОшибке = Истина, Кодировка = "UTF-8") Экспорт
	
	Команда = Соединение.НовыйКомандаSSH(ТекстКоманды, Кодировка);
	Вывод = Команда.ВыполнитьКоманду();

	// проверяем ошибки 
	Если Не Команда.ПолучитьСтатусЗавершения() = 0 Тогда 
		
		Ошибка = Команда.ПолучитьОшибку();
		
		Если РазорватьСоединениеПриОшибке = Истина Тогда
			Попытка
				Соединение.Разорвать();
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		ВызватьИсключение Ошибка;
		
	КонецЕсли;
	
	Возврат Вывод;
	
КонецФункции

#КонецОбласти