// Возвращает строку соединения по имени. 
// Аналог функции получения строки из web.config
//
Функция ПолучитьСтрокуСоединения(ИмяСоединения) Экспорт
	
	Возврат ПолучитьПараметрыСоединения(ИмяСоединения).СтрокаСоединения;
	
КонецФункции

// Возвращает тип СУБД для соединения по имени. 
// Аналог функции получения типа СУБД из web.config
//
Функция ПолучитьТипСУБД(ИмяСоединения) Экспорт
	
	ТипСУБД = ПолучитьПараметрыСоединения(ИмяСоединения).ТипСУБД;
	
	Если ТипСУБД = Перечисления.ТипыСУБД.SQLite Тогда
		Возврат 0;
	ИначеЕсли ТипСУБД = Перечисления.ТипыСУБД.MSSQLServer Тогда
		Возврат 1;
	ИначеЕсли ТипСУБД = Перечисления.ТипыСУБД.MySQL Тогда
		Возврат 2;
	ИначеЕсли ТипСУБД = Перечисления.ТипыСУБД.PostgreSQL Тогда
		Возврат 3;
	Иначе
		ВызватьИсключение "Неизвестный тип СУБД";
	КонецЕсли;

	
КонецФункции

Функция ПолучитьПараметрыСоединения(ИмяСоединения)
	
	Параметры = Справочники.ПараметрыСоединенийСУБД.НайтиПоКоду(ИмяСоединения);
	
	Если Параметры = Справочники.ПараметрыСоединенийСУБД.ПустаяСсылка() Тогда
		ВызватьИсключение "Строка соединения не найдена";
	КонецЕсли;
	
	Возврат Параметры;

КонецФункции