////////////////////////////////////////////////////////////////////////////////
// 
// Реализует функции работы с паролями для объектов УчетныеДанные
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Устанавливает пароль, соответствующий учетной записи
//
// Параметры:
//  УчетныеДанные	 - СправочникСсылка.УчетныеДанныеАИТП	 - ссылка на объект учетных данных
//  Пароль	 - Строка	 - пароль к учетной записи
// 
&НаСервере
Процедура УстановитьПароль(УчетныеДанные, Пароль) Экспорт
	
	КонфиденциальныеДанныеАИТП.ВставитьКонфиденциальныеДанные(УчетныеДанные.Ссылка, , ПолучитьДвоичныеДанныеИзСтроки(Пароль));	
	
КонецПроцедуры

// Возвращает пароль, соответствующий учетной записи
//
// Параметры:
//  УчетныеДанные	 - СправочникСсылка.УчетныеДанныеАИТП	 - ссылка на объект учетных данных
// 
// Возвращаемое значение:
//   -  Строка - пароль
//
&НаСервере
Функция ПолучитьПароль(УчетныеДанные) Экспорт
	
	Возврат КонфиденциальныеДанныеАИТП.ПолучитьКонфиденциальныеДанныеКакСтроку(УчетныеДанные.Ссылка);	
	
КонецФункции

#КонецОбласти
