

#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	// Если задача обработки ошибки - вместо описания задачи отображаем ошибку для обработки
	Если Объект.ВидЗадачи = Перечисления.ВидыЗадачАИТП.ОбработкаОшибки Тогда
		
		ЭтаФорма.Элементы.Описание.Видимость = Ложь;
		ЭтаФорма.Элементы.ОшибкаДляОбработкиОписание.Видимость = Истина;
		ЭтаФорма.Элементы.ОшибкаДляОбработки.Видимость = Истина;
		
	КонецЕсли;
	
	// Если результат выполнения задачи ошибка - отображаем ошибку и описание вмето описания результата
	Если  Объект.Результат = Перечисления.РезультатыВыполненияДействияАИТП.Ошибка Тогда
		
		ЭтаФорма.Элементы.Ошибка.Видимость = Истина;
		ЭтаФорма.Элементы.ОшибкаОписаниеОшибки.Видимость = Истина;
		ЭтаФорма.Элементы.ОписаниеРезультата.Видимость = Ложь;
		
	Иначе
		
		ЭтаФорма.Элементы.Ошибка.Видимость = Ложь;
		ЭтаФорма.Элементы.ОшибкаОписаниеОшибки.Видимость = Ложь;
		ЭтаФорма.Элементы.ОписаниеРезультата.Видимость = Истина;
		
	КонецЕсли;

	Если Объект.Выполнена = Истина И Не ПользователиАИТП.ИмеетРоль("РедактированиеВыполненныхЗадачАИТП") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ВедущаяЗадача = Объект.БизнесПроцесс.ВедущаяЗадача;
	
КонецПроцедуры


&НаКлиенте
Процедура СтатусВыполненияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	// Если результат - ошибка, отображаем ошибку и описание вместо описания результата
	Если  ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.РезультатыВыполненияДействияАИТП.Ошибка") Тогда
		
		ЭтаФорма.Элементы.Ошибка.Видимость = Истина;
		ЭтаФорма.Элементы.ОшибкаОписаниеОшибки.Видимость = Истина;
		ЭтаФорма.Элементы.ОписаниеРезультата.Видимость = Ложь;
		
	Иначе
		
		ЭтаФорма.Элементы.Ошибка.Видимость = Ложь;
		ЭтаФорма.Элементы.ОшибкаОписаниеОшибки.Видимость = Ложь;
		ЭтаФорма.Элементы.ОписаниеРезультата.Видимость = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПараметрыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОбновитьКартуМаршрута();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СтатьИсполнителем(Команда)
	
	СтатьИсполнителемНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьКартуМаршрута()
	
	Если ЗначениеЗаполнено(Объект.БизнесПроцесс) Тогда
		КартаМаршрута = Объект.БизнесПроцесс.ПолучитьОбъект().ПолучитьКартуМаршрута();
	ИначеЕсли Объект.БизнесПроцесс <> Неопределено Тогда
		КартаМаршрута = БизнесПроцессы[Объект.БизнесПроцесс.Метаданные().Имя].ПолучитьКартуМаршрута();
		Возврат;
	Иначе
		КартаМаршрута = Новый ГрафическаяСхема;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СтатьИсполнителемНаСервере()
	// Вставить содержимое обработчика.
	Объект.Исполнитель = ПользователиАИТП.ТекущийПользователь();
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти


