Перем _Запрос Экспорт;  

Перем Текст Экспорт;
Перем Таймаут Экспорт;
Перем Параметры Экспорт;

Функция ВыполнитьЗапрос() Экспорт
	
	УстановитьПараметрыВыполнения();
	Результат = Обработки.РезультатыЗапросаСУБД.Создать();
	Результат._Результаты = _Запрос.Execute();
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьКоманду() Экспорт
	
	УстановитьПараметрыВыполнения();
	Возврат _Запрос.ExecuteCommand();

КонецФункции

Процедура УстановитьПараметр(Имя, Значение) Экспорт
	
	Параметры.Вставить(Имя, Значение);
	
КонецПроцедуры

Процедура УстановитьСоединение(Соединение) Экспорт
	
	_Запрос = Соединение._Соединение.CreateQuery();
	
КонецПроцедуры

Процедура УстановитьПараметрыВыполнения()
	
	_Запрос.Timeout = Таймаут;
	_Запрос.Text = Текст;
	
	Для каждого Параметр Из Параметры Цикл
	
		Если ТипЗнч(Параметр.Значение) = Тип("ДвоичныеДанные") Тогда
	
			_Запрос.SetParameter(Параметр.Ключ, Base64Строка(Параметр.Значение), Истина);	
	
		Иначе
		
		_Запрос.SetParameter(Параметр.Ключ, Параметр.Значение, Ложь);
	
		КонецЕсли;		
			
	КонецЦикла; 

КонецПроцедуры

Текст = "";
Таймаут = 0;
Параметры = Новый Структура;

