/////////////////////////////////////////////////////////////////////////////////
//
// Переопределяемые функции для установки параметров сеанса
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает соответствие имен параметров сеанса и обработчиков для их инициализации.
//  
//  Для задания обработчиков параметров сеанса следует использовать шаблон:
//  Обработчики.Вставить("<ИмяПараметраСеанса>|<НачалоИмениПараметраСеанса*>", "Обработчик");
//  
//  Примечание. Символ '*'используется в конце имени параметра сеанса и обозначает,
//  что один обработчик будет вызван для инициализации всех параметров сеанса
//  с именем, начинающимся на слово НачалоИмениПараметраСеанса
//
// Параметры:
//  Обработчики	 - Соответствие	 - список обработчиков установки параметров сеанса
//
Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
		
КонецПроцедуры

#КонецОбласти