//////////////////////////////////////////////////////////////////////////////////////////////////////
//
// Реализация действий бизнес-процесса ОтправитьHTTPЗапросАИТП
//
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Реализация регламентного задания для отправки http-запросов
//
Процедура ОтправитьHTTPЗапросыАИТП() Экспорт
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ВыполнитьДействияПоТочкеМаршрута(
		БизнесПроцессы.ОтправитьHTTPЗапросАИТП.ТочкиМаршрута.ОтправитьHTTPЗапрос
		, "ОтправитьHTTPЗапросАИТП.ОбработчикВыполнитьДействиеОтправитьHTTPЗапрос"
		, // Обработчик перед выполнением действий
		, // Обработчик после выполнения действий
		, // Обработчик ошибки при выполнении действия
		, // Обработчик ошибки перед выполнением действий
		, // Обработчик ошибки после выполнения действий
		, // Обработчик оповещения при выполнении действия
		, // Обработчик оповещения перед выполнением действий
		, // Обработчик оповещения после выполнения действий
	);

КонецПроцедуры

// Реализация действия отправки http-запроса
//
Процедура ОбработчикВыполнитьДействиеОтправитьHTTPЗапрос(ТочкаМаршрута, Задача, ПараметрыВыполнения) Экспорт
	
	БизнесПроцесс = Задача.БизнесПроцесс.ПолучитьОбъект();
	Заголовки = Новый Соответствие;
	
	Для каждого Заголовок Из БизнесПроцесс.Заголовки Цикл
		Заголовки.Вставить(Заголовок.Имя, Заголовок.Значение);
	КонецЦикла;
	
	Ответ = ФункцииHttpАИТП.ОтправитьЗапрос(
				БизнесПроцесс.ТипЗапроса
				, БизнесПроцесс.URL
				, БизнесПроцесс.НастройкиСоединения
				, БизнесПроцесс.ТелоЗапроса
				, Заголовки
			);
			
	ФункцииHttpАИТП.ПроверитьКодСостояния(Ответ, 200, "В процессе выполнения запроса возникли ошибки:");
	БизнесПроцесс.ТелоОтвета = Ответ.ТелоОтвета;
	БизнесПроцесс.Записать();
	
КонецПроцедуры

#КонецОбласти