#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьНаСервере()
	// Вставить содержимое обработчика.
	УстановитьПривилегированныйРежим(Истина);
	ИдентификаторПользователяИБ = ПользователиАИТП.ТекущийПользователь().Код;
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ИдентификаторПользователяИБ));
	СообщениеПользователю = Новый СообщениеПользователю;
	
	Если ПользовательИБ.ЗапрещеноИзменятьПароль = Истина Тогда
		СообщениеПользователю.Текст = "Изменение пароля запрещено администратором";
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;

	
	Если Не Объект.Пароль = Объект.Подтверждение Тогда
		СообщениеПользователю.Текст = "Пароль и подтверждение не совпадают";
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПользовательИБ.Пароль = Объект.Пароль;
	ПользовательИБ.Записать();
	СообщениеПользователю.Текст = "Пароль был успешно изменен";
	СообщениеПользователю.Сообщить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
	УстановитьНаСервере();
КонецПроцедуры

#КонецОбласти