////////////////////////////////////////////////////////////////////////////////
// Реализация точки входа для работы с библиотекой
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Создает новое соединение SSH
//
// Параметры:
//  Хост  - Строка - DNS имя или ip-адрес хоста
//  Порт  - Число - Номер порта для соединения. Стандартный порт - 22
//  Пользователь  - Строка - логин пользователя
//  Пароль  - Строка - пароль пользователя
// Возвращаемое значение:
//   ОбработкаОбъект.КлиентSSHСлужебная   - обработка для работы с соединением SSH
//
Функция НовыйКлиентSSH(Хост, Порт, Пользователь, Пароль) Экспорт
	
	ОбработкаКлиентSSH = Обработки.КлиентSSHСлужебная.Создать();
	Фабрика = Новый COMОбъект("SshDataProcessorCom.SshDataProcessorCom");
	ОбработкаКлиентSSH.COMОбъектКлиентSSH = Фабрика.NewSSHClient(Хост, Порт, Пользователь, Пароль);
	
	Возврат ОбработкаКлиентSSH;
	
КонецФункции

#КонецОбласти



