////////////////////////////////////////////////////////////////////////////////
// Реализация функций класса ПотокSSH
//  
////////////////////////////////////////////////////////////////////////////////

Перем COMОбъектПотокSSH Экспорт; // Экземпляр COM-объекта SshDataProcessorCom.StreamCom


#Область ПрограммныйИнтерфейс

// Записывает данные в поток и возвращает результаты вывода
//
// Параметры:
// Команда - Строка - команда shell
// Возвращаемое значение:
// Строка - результат вывода
//
Функция ЗаписатьВПоток(Команда) Экспорт
	
	Возврат COMОбъектПотокSSH.WriteLine(Команда);
	
КонецФункции

// Завершает соединение
//
Процедура Разорвать() Экспорт
	
	COMОбъектПотокSSH.DisconnectStream();

КонецПроцедуры

#КонецОбласти


