//////////////////////////////////////////////////////////////////////////////////////////////////////
//
// Функции интеграции с типовыми конфигурациями
//
/////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Проверяет, является ли тип объекта, одним из типов бизнес-процессов конфигурации АИТП
//
// Параметры:
//  БизнесПроцессОбъект	 - БизнесПроцессОбъект	 -  объект для проверки
// 
// Возвращаемое значение:
//  Булево - Истина, если тип является типом из базовой подсистемы, иначе Ложь
//
Функция ЭтоБизнесПроцессПодсистемАИТП(БизнесПроцессОбъект) Экспорт
	
	ТипОбъекта = ТипЗнч(БизнесПроцессОбъект);
	
	Возврат	
		ТипОбъекта = Тип("БизнесПроцессОбъект.ОтправитьHTTPЗапросАИТП")
		Или ТипОбъекта = Тип("БизнесПроцессОбъект.ОтправитьСообщениеПоЭлектроннойПочтеАИТП")
		Или ТипОбъекта = Тип("БизнесПроцессОбъект.ИзменитьПользователяАИТП")
		Или ТипОбъекта = Тип("БизнесПроцессОбъект.ИзменитьПользователяИнформационнойБазыАИТП")
		Или ТипОбъекта = Тип("БизнесПроцессОбъект.СоздатьПользователяАИТП")
		Или ТипОбъекта = Тип("БизнесПроцессОбъект.СоздатьПользователяИнформационнойБазыАИТП")
		Или ТипОбъекта = Тип("БизнесПроцессОбъект.СоздатьПользователяПодсистемыАИТП")
		
		Или ?(Метаданные.Подсистемы.Найти("ОбменДаннымиАИТП") = Неопределено, Ложь, 
		ТипОбъекта = Тип("БизнесПроцессОбъект.ОтправитьСообщениеОбменаАИТП")
		Или ТипОбъекта = Тип("БизнесПроцессОбъект.ОтправитьСообщениеОбменаПолучателямАИТП")
		)
		Или ?(Метаданные.Подсистемы.Найти("ОбновлениеСистемыАИТП") = Неопределено, Ложь,
		ТипОбъекта = Тип("БизнесПроцессОбъект.ВыполнитьДействияПослеОбновленияАИТП")
		Или ТипОбъекта = Тип("БизнесПроцессОбъект.ПодготовитьСистемуКОбновлениюАИТП")
		)

		;

КонецФункции

// Проверяет, является ли тип объекта, одним из типов документов конфигурации АИТП
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъект	 -  объект для проверки
// 
// Возвращаемое значение:
//  Булево - Истина, если тип является типом из базовой подсистемы, иначе Ложь
//
Функция ЭтоДокументПодсистемАИТП(ДокументОбъект) Экспорт
	
	ТипОбъекта = ТипЗнч(ДокументОбъект);
	
	Возврат	
	    ТипОбъекта = Тип("ДокументОбъект.РегистрацияПроцессаДляВыполненияАИТП")
		Или ТипОбъекта = Тип("ДокументОбъект.ОшибкиВыполненияАИТП")
		
		Или ?(Метаданные.Подсистемы.Найти("ОбновлениеСистемыАИТП") = Неопределено, Ложь,
		ТипОбъекта = Тип("ДокументОбъект.ПодготовитьСистемуКОбновлениюАИТП")
		Или ТипОбъекта = Тип("ДокументОбъект.ВыполнитьДействияПослеОбновленияАИТП")
		)

		;
	
КонецФункции
	
// Проверяет, является ли тип объекта, одним из типов наборов записей конфигурации АИТП
//
// Параметры:
//  НаборЗаписей - РегистрСведенийНаборЗаписей	 - набор записей для проверки
// 
// Возвращаемое значение:
//  Булево - Истина, если тип является типом из базовой подсистемы, иначе Ложь
//
Функция ЭтоНаборЗаписейПодсистемАИТП(НаборЗаписей) Экспорт
	
	ТипОбъекта = ТипЗнч(НаборЗаписей);
	
	Возврат	
	    ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.АсинхронныеЗадачиАИТП")
		Или ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ПоследниеВыполненныеЗадачиАИТП")
		Или ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.КонфиденциальныеДанныеАИТП")
		Или ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ДополнительныеДанныеАИТП")
		Или ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ДополнительныеРеквизитыПроцессовАИТП")
		Или ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ДополнительныеДанныеАИТП")
		Или ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.НастройкиАдресацииЗадачАИТП")
		Или ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.НастройкиАдресацииОповещенийАИТП")
		Или ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ЧленствоВГруппахАдресацииЗадачАИТП")
		Или ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ЧленствоВГруппахКонтактовАИТП")
		
		Или ?(Метаданные.Подсистемы.Найти("ОбменДаннымиАИТП") = Неопределено, Ложь,
		ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ЧленствоВГруппахПолучателейСообщенийОбменаАИТП")
		)	

		;
	
КонецФункции
	
// Проверяет, является ли тип объекта, одним из типов задач конфигурации АИТП
//
// Параметры:
//  ЗадачаОбъект - ЗадачаОбъект	 - объект для проверки
// 
// Возвращаемое значение:
//  Булево - Истина, если тип является типом из базовой подсистемы, иначе Ложь
//
Функция ЭтоЗадачаПодсистемАИТП(ЗадачаОбъект) Экспорт
	
	ТипОбъекта = ТипЗнч(ЗадачаОбъект);
	
	Возврат	
	    ТипОбъекта = Тип("ЗадачаОбъект.ЗадачаАИТП")
		;
	
КонецФункции
	
#КонецОбласти