Перем _Соединение Экспорт;

Перем ТипСУБД Экспорт;
Перем СтрокаСоединения Экспорт;

Функция Открыть() Экспорт
	
	_Соединение.ConnectionString = СтрокаСоединения;
	_Соединение.DbType = ТипСУБД;
	Результат = _Соединение.Open();
	Возврат Результат;
	
КонецФункции

Процедура Закрыть() Экспорт
	
	_Соединение.Close();
	
КонецПроцедуры

Функция СоздатьЗапрос() Экспорт

	ЗапросСУБД = Обработки.ЗапросСУБД.Создать();
	ЗапросСУБД._Запрос = _Соединение.CreateQuery();
	ЗапросСУБД.Таймаут = ЗапросСУБД._Запрос.Timeout;
	Возврат ЗапросСУБД;
	
КонецФункции

_Соединение = Новый COMОбъект("OScriptSql.Com.DBConnector");
СтрокаСоединения = "";
ТипСУБД = Обработки.СоединениеСУБД.ТипыСУБД().SQLite;
