//////////////////////////////////////////////////////////////////////////////////////////////////////
//
// Реализация функционала напоминаний. 
// Из БСП
//
/////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Обработчик ожидания проверки напоминаний пользователя
//
Процедура ПроверитьТекущиеНапоминанияАИТП() Экспорт

	//ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента();
	ИнтервалПроверкиНапоминаний = НапоминанияПользователяВызовСервераАИТП.ПолучитьИнтервалПроверкиНапоминаний();
	
	Если ИнтервалПроверкиНапоминаний = 0 Тогда
		ИнтервалПроверкиНапоминаний = 1;
	КонецЕсли;
	//
	//// открываем форму текущих оповещений
	ВремяБлижайшего = Неопределено;
	ИнтервалСледующейПроверки = ИнтервалПроверкиНапоминаний * 60;
	//
	Если НапоминанияПользователяКлиентАИТП.ПолучитьТекущиеОповещения(ВремяБлижайшего).Количество() > 0 Тогда
		НапоминанияПользователяКлиентАИТП.ОткрытьФормуОповещения();
	ИначеЕсли ЗначениеЗаполнено(ВремяБлижайшего) Тогда
		ИнтервалСледующейПроверки = Макс(Мин(ВремяБлижайшего - ТекущаяДата(), ИнтервалСледующейПроверки), 1);
	КонецЕсли;
	//
	ПодключитьОбработчикОжидания("ПроверитьТекущиеНапоминанияАИТП", ИнтервалСледующейПроверки, Истина);
	
КонецПроцедуры

#КонецОбласти