////////////////////////////////////////////////////////////////////////////////
// Реализация функций класса СоединениеSSH
//  
////////////////////////////////////////////////////////////////////////////////

Перем COMОбъектСоединениеSSH Экспорт; // Экземпляр COM-объекта SshDataProcessorCom.SshConnectionCom

#Область ПрограммныйИнтерфейс

// Выполняет команду на удаленном сервере
//
// Параметры:
// Команда - Строка - команда для выполнения
//
// Возвращаемое значение:
// Строка - результат выполнения команды
//
Функция  ВыполнитьКоманду(Команда) Экспорт
	
	Возврат COMОбъектСоединениеSSH.Execute(Команда);
	
КонецФункции

// Завершает текущее соединение
//
Процедура Разорвать() Экспорт
	
	COMОбъектСоединениеSSH.Disconnect();
	
КонецПроцедуры

// Создает объект команды SSH
//
// Параметры:
//  Команда  - Строка - команда SSH
//  КодировкаТекста  - Строка - Кодировка взаимодействия с севером
//
// Возвращаемое значение:
//   ОбработкаОбъект.КомандаSSHСлужебная   - Объект команды
//
Функция НовыйКомандаSSH(Команда, КодировкаТекста) Экспорт

	КомандаSSH = Обработки.КомандаSSHСлужебная.Создать();
	КомандаSSH.COMОбъектКомандаSSH = COMОбъектСоединениеSSH.NewSshCommand(Команда, КодировкаТекста);
	Возврат КомандаSSH;

КонецФункции // НовыйКомандаSSH()
 
#КонецОбласти




