#Область ОписаниеПеременных

Перем ПараметрыПриложения Экспорт; // Параметры приложения

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриНачалеРаботыСистемы()
	
	// Инициализируем подсистему напоминаний пользователя
	НапоминанияПользователяКлиентАИТП.ПриНачалеРаботыСистемы();
	ПараметрыПриложения = Новый Соответствие;
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	// Вызываем диалог диалог подтверждения завершения работы
	// Для соответствия 1С:Совместимо
	//
	Отказ = Истина;
	ТекстПредупреждения = "Завершить работу с программой?";
	
КонецПроцедуры

#КонецОбласти



