
Функция ОбработчикВходящихСообщений(Запрос)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
	Данные = ПрочитатьJSON(ЧтениеJSON, Истина);
	
	Отправитель = Справочники.УзлыОбменаДаннымиАИТП.НайтиПоКоду(Данные["SenderCode"]);
	
	Если Отправитель.Пустая() Тогда
		ВызватьИсключение "Узел с кодом: " + Данные["SenderCode"] + " не найден в списке узлов";	
	КонецЕсли;

	ИдентификаторСообщения = Данные["MessageID"];
	Данные = Данные["Data"];
	
	СтандартнаяОбработка = Истина;
	ОбменДаннымиПереопределяемыйАИТП.ОбработатьВходящееСообщение(Отправитель, ИдентификаторСообщения, Данные, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка = Истина Тогда
		ОбменДаннымиАИТП.ОбработатьВходящееСообщение(Отправитель, ИдентификаторСообщения, Данные, СтандартнаяОбработка);
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции
