////////////////////////////////////////////////////////////////////////////////
//
// Переопределяемые функции обмена данными
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура обработки входящего сообщения для переопределения в прикладном решении
//
// Параметры:
//  Отправитель				 - СправочникСсылка.УзлыОбменаАИТП	 - идентификатор отправителя
//  ИдентификаторСообщения	 - Строка	 - уникальный идентификатор сообщения
//  Данные					 - Строка, Соответствие, Неопределено	 - данные сообщения.
//  СтандартнаяОбработка	 - Булево	 - Флаг вызова стандартной обработки сообщения
//
Процедура ОбработатьВходящееСообщение(Отправитель, ИдентификаторСообщения, Данные, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти