//////////////////////////////////////////////////////////////////////////////////////////////////////
//
// Реализация действий бизнес-процесса ИзменитьПользователяАИТП
//
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Реализация регламентного задания для изменеия пользователя АИТП
//
Процедура ИзменитьПользователейАИТП() Экспорт
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ВыполнитьДействияПоТочкеМаршрута(
		БизнесПроцессы.ИзменитьПользователяАИТП.ТочкиМаршрута.ИзменитьПользователяАИТП
		, "ИзменитьПользователяАИТП.ОбработчикВыполнитьДействиеИзменитьПользователяАИТП"
		, // Обработчик перед выполнением действий
		, // Обработчик после выполнения действий
		, // Обработчик ошибки при выполнении действия
		, // Обработчик ошибки перед выполнением действий
		, // Обработчик ошибки после выполнения действий
		, // Обработчик оповещения при выполнении действия
		, // Обработчик оповещения перед выполнением действий
		, // Обработчик оповещения после выполнения действий
	);

КонецПроцедуры


// Реализация действия изменения пользователя АИТП
//
Процедура ОбработчикВыполнитьДействиеИзменитьПользователяАИТП(ТочкаМаршрута, Задача, ПараметрыВыполнения) Экспорт
	
	БизнесПроцесс = Задача.БизнесПроцесс;
	ПользовательАИТП = БизнесПроцесс.ПользовательАИТП.ПолучитьОбъект();
	
	Если БизнесПроцесс.ИзменитьПометкаУдаления = Истина Тогда
		ПользовательАИТП.ПометкаУдаления = БизнесПроцесс.ПомеченДляУдаления;
	КонецЕсли;
	
	Наименование = "";
	
	Если БизнесПроцесс.ИзменитьУникальныйИдентификатор = Истина Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(БизнесПроцесс.УникальныйИдентификатор));
		Наименование = ПользовательИБ.ПолноеИмя;
	КонецЕсли;
	
	Если Не БизнесПроцесс.Наименование = "" Тогда
		Наименование = БизнесПроцесс.Наименование;
	КонецЕсли;
	
	Если БизнесПроцесс.ИзменитьНаименование = Истина Тогда
		ПользовательАИТП.Наименование = Наименование;
	КонецЕсли;
	
	ПользовательАИТП.Записать();
	
КонецПроцедуры

#КонецОбласти