////////////////////////////////////////////////////////////////////////////////
// Реализация функций класса КлиентSSH
//  
////////////////////////////////////////////////////////////////////////////////

Перем COMОбъектКлиентSSH Экспорт; // Экземпляр com-объекта SshDataProcessorCom.SshDataProcessorCom 

#Область ПрограммныйИнтерфейс

// Создает поток SSH
//
// Возвращаемое значение:
//   ОбработкаОбъект.ПотокSSHСлужебная   - обработка для работы с потоком ввода/вывода в соединении SSH
//
Функция ПолучитьПоток() Экспорт
	
	Поток = Обработки.ПотокSSHСлужебная.Создать();
	Поток.COMОбъектПотокSSH = COMОбъектКлиентSSH.CreateStream();
	Возврат Поток;
	
КонецФункции

// Создает соединение SSH
//
// Возвращаемое значение:
//   ОбработкаОбъект.СоединениеSSHСлужебная   - обработка для работы с соединением SSH
//
Функция ПолучитьСоединение() Экспорт
	
	Соединение = Обработки.СоединениеSSHСлужебная.Создать();
	Соединение.COMОбъектСоединениеSSH = COMОбъектКлиентSSH.Create();
	
	Возврат Соединение;
	
КонецФункции

// Создает соединение SCP
//
// Возвращаемое значение:
//   ОбработкаОбъект.СоединениеSCPСлужебная   - обработка для загрузки/выгрузки файлов
//
Функция ПолучитьSCP() Экспорт
	
	СоединениеSCP = Обработки.СоединениеSCPВнутрИсп.Создать();
	СоединениеSCP.COMОбъектСоединениеSCP = COMОбъектКлиентSSH.CreateScp();
	
	Возврат СоединениеSCP;
	
КонецФункции

// Создает соединение SCP
//
// Параметры:
// ПутьКФайлуКлюча - Строка - Путь к файлу ключа для проверки подлинности
// Пароль - Строка - Пароль, которым защищен ключ
//
Процедура УстановитьКлюч(ПутьКФайлуКлюча, Пароль = "") Экспорт
	
	COMОбъектКлиентSSH.SetSshKey(ПутьКФайлуКлюча, Пароль);

КонецПроцедуры

#КонецОбласти

