#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаданиеИД = Параметры.ИдентификаторЗадания;
	ФоновоеЗадание = Обработки.КонсольЗаданийАИТП.Создать().ПолучитьОбъектФоновогоЗадания(ЗаданиеИД);
	
	Если ФоновоеЗадание <> Неопределено Тогда
		ИмяМетода = ФоновоеЗадание.ИмяМетода;
		Наименование = ФоновоеЗадание.Наименование;
		Ключ = ФоновоеЗадание.Ключ;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	ВыполнитьФоновоеЗадание();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьФоновоеЗадание()
	Попытка	
	    ФоновоеЗадание = ФоновыеЗадания.Выполнить(ИмяМетода,, Ключ, Наименование);
		Закрыть(ФоновоеЗадание.УникальныйИдентификатор);
	Исключение	
		Ошибка = ОписаниеОшибки();
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = Ошибка;
		СообщениеПользователю.Сообщить();
	КонецПопытки;
КонецПроцедуры

#КонецОбласти