///////////////////////////////////////////////////////////////////////////////////
//
// Обработчики действий бизнес-процесса МониторингНедоступногоСервисаOneScriptАИТП
//
//////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - обработчик действия ПроверитьДоступностьСервисаOneScript
//
// Параметры:
//  ТочкаМаршрута  - БизнесПроцессы.МониторингНедоступногоСервисаOneScriptАИТП.ТочкиМаршрута.ПроверитьДоступностьСервисаOneScript - точка маршрута действия
//  Задача  - ЗадачаСсылка.ЗадачаАИТП - Ссылка на выполняемую задачу
//  ПараметрыВыполнения  - Соответствие - параметры выполнения
//
Процедура ПроверитьДоступностьСервисаOneScript(ТочкаМаршрута, Задача, ПараметрыВыполнения) Экспорт
	// Вставить содержимое обработчика.
	БизнесПроцесс = Задача.БизнесПроцесс;
	
	Результат = МониторингДоступностиСервисовOneScriptАИТП.ВыполнитьТесты(БизнесПроцесс.Сервис);
	Задача.ОписаниеРезультата = МониторингДоступностиСервисовOneScriptАИТП.СформироватьОтчетПоРезультатамТестов(Результат);
	
	Если Результат.БылиОшибки = Истина Тогда
		Задача.Результат = Перечисления.РезультатыВыполненияДействияАИТП.Отрицательный;
	Иначе
		Задача.Результат = Перечисления.РезультатыВыполненияДействияАИТП.Положительный;
	КонецЕсли;
	
	Задача.ДальнейшиеДействия = Перечисления.ДальнейшиеДействияАИТП.Продолжить;
	Задача.Записать();
	
КонецПроцедуры

#КонецОбласти