///////////////////////////////////////////////////////////////////////////////////////////////
//
// Переопределяемые функции оповещение пользователей по эл. почте
//
//////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура - Заполняет тему и тело сообщения. Переопределяется пользователем
//
// Параметры:
//  Тема				 - Строка - тема письма 
//  Тело				 - Строка - тело письма 
//  ПараметрыОповещения	 - Структура - структура, содержащая параметры оповещения 
//  СтандартнаяОбработка - Булево - признак использования стандартной обработки 
//
Процедура ЗаполнитьТемуИТелоСообщения(Тема, Тело, ПараметрыОповещения, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти