#Область СлужебныеПроцедурыИФункции

Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ПередСтартомБП(
			ТочкаМаршрутаБизнесПроцесса,
			ЭтотОбъект
		);
		
КонецПроцедуры

Процедура ИзменитьПользователяИнформационнойБазыПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ПриСозданииЗадачи(
			ТочкаМаршрутаБизнесПроцесса,
			ФормируемыеЗадачи[0],
			Перечисления.ВидыЗадачАИТП.Действие,
			"ИзменитьПользователейИнформационнойБазыАИТП"
		);
			
КонецПроцедуры

Процедура ИзменитьПользователяИнформационнойБазыПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ПриВыполненииЗадачи(
			ТочкаМаршрутаБизнесПроцесса,
			Задача
		);
		
КонецПроцедуры

Процедура РезультатИзмененияПользователяОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	// Вставить содержимое обработчика.
	Результат = БизнесПроцессыАИТП.ВыборВариантаРезультатПоложительныйОтрицательныйОшибка(
			ТочкаВыбораВарианта,
			ЭтотОбъект,
			БизнесПроцессы.ИзменитьПользователяИнформационнойБазыАИТП.ТочкиМаршрута.ИзменитьПользователяИнформационнойБазы
		);
		
КонецПроцедуры

Процедура ОбработатьОшибкуИзмененияПользователяИБПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	// Вставить содержимое обработчика.
	Задача = БизнесПроцессыАИТП.ПолучитьИнформациюОПоследнейВыполненнойЗадаче(
			ЭтотОбъект,
			БизнесПроцессы.ИзменитьПользователяИнформационнойБазыАИТП.ТочкиМаршрута.ИзменитьПользователяИнформационнойБазы
		).Задача;
		
	ФормируемыеЗадачи[0].ОшибкаДляОбработки = Задача.Ошибка;
	
	БизнесПроцессыАИТП.ПриСозданииЗадачи(
			ТочкаМаршрутаБизнесПроцесса,
			ФормируемыеЗадачи[0],
			Перечисления.ВидыЗадачАИТП.ОбработкаОшибки
		);
		
КонецПроцедуры

Процедура ОбработатьОшибкуИзмененияПользователяИБПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ПриВыполненииЗадачи(
			ТочкаМаршрутаБизнесПроцесса,
			Задача
		);
		
КонецПроцедуры

Процедура ДальнейшиеДействияОбработатьОшибкуИзмененияПользователяИБОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	// Вставить содержимое обработчика.
	Результат = БизнесПроцессыАИТП.ВыборВариантаПродолжитьПовторитьЗавершитьОтменить(
			ТочкаВыбораВарианта,
			ЭтотОбъект,
			БизнесПроцессы.ИзменитьПользователяИнформационнойБазыАИТП.ТочкиМаршрута.ОбработатьОшибкуИзмененияПользователяИБ
		);
		
КонецПроцедуры

Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	// Вставить содержимое обработчика.
	Если Не ЭтотОбъект.НеУдалятьПарольПриЗавершении = Истина Тогда
		УстановитьПривилегированныйРежим(Истина);
		КонфиденциальныеДанныеАИТП.УдалитьКонфиденциальныеДанные(ЭтотОбъект.Ссылка);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	БизнесПроцессыАИТП.ПриЗавершенииБП(
			ТочкаМаршрутаБизнесПроцесса
			, ЭтотОбъект
			, Перечисления.РезультатыВыполненияДействияАИТП.Положительный
			, Перечисления.ДальнейшиеДействияАИТП.Продолжить
		);
		
КонецПроцедуры

Процедура УстановитьПароль(Пароль) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	КонфиденциальныеДанныеАИТП.ВставитьКонфиденциальныеДанные(ЭтотОбъект.Ссылка,, ПолучитьДвоичныеДанныеИзСтроки(Пароль));
	
КонецПроцедуры

Процедура ЗавершениеОтменитьПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	// Вставить содержимое обработчика.
	Если Не ЭтотОбъект.НеУдалятьПарольПриЗавершении = Истина Тогда
		УстановитьПривилегированныйРежим(Истина);
		КонфиденциальныеДанныеАИТП.УдалитьКонфиденциальныеДанные(ЭтотОбъект.Ссылка);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	БизнесПроцессыАИТП.ПриЗавершенииБП(
		ТочкаМаршрутаБизнесПроцесса
		, ЭтотОбъект
		, Перечисления.РезультатыВыполненияДействияАИТП.Отрицательный
		, Перечисления.ДальнейшиеДействияАИТП.Отменить
		);

КонецПроцедуры

Процедура ЗавершениеЗавершитьПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	// Вставить содержимое обработчика.
	Если Не ЭтотОбъект.НеУдалятьПарольПриЗавершении = Истина Тогда
		УстановитьПривилегированныйРежим(Истина);
		КонфиденциальныеДанныеАИТП.УдалитьКонфиденциальныеДанные(ЭтотОбъект.Ссылка);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
		
	БизнесПроцессыАИТП.ПриЗавершенииБП(
		ТочкаМаршрутаБизнесПроцесса
		, ЭтотОбъект
		, Перечисления.РезультатыВыполненияДействияАИТП.Отрицательный
		, Перечисления.ДальнейшиеДействияАИТП.Завершить
		);

КонецПроцедуры

#КонецОбласти