////////////////////////////////////////////////////////////////////////////////
// Реализация класса КомандаSSH
//  
////////////////////////////////////////////////////////////////////////////////

Перем COMОбъектКомандаSSH Экспорт; // Экземпляр COM-объекта SshDataProcessorCom.SshCommandCom


#Область ПрограммныйИнтерфейс

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьСтатусЗавершения() Экспорт

	Возврат COMОбъектКомандаSSH.GetExitStatus();

КонецФункции // ПолучитьСтатусЗавершения()
 
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьОшибку() Экспорт

	Возврат COMОбъектКомандаSSH.GetError();

КонецФункции // ПолучитьОшибку()
 
// Устанавливает таймаут выполнения команды
//
// Параметры:
//  Часы  - Число - количество часов
//  Минуты  - Число - количество минут
//  Секунды  - Число - количество секунд
//
Процедура УстановитьТаймаут(Часы, Минуты, Секунды) Экспорт

	COMОбъектКомандаSSH.SetTimeout(Часы, Минуты, Секунды);

КонецПроцедуры // УстановитьТаймаут()

// получает данные из потока вывода как строку
//
// Возвращаемое значение:
//   Строка   - текстовое представление потока вывода
//
Функция ПрочитатьПотокВыводаКакСтроку() Экспорт

	Возврат COMОбъектКомандаSSH.ReadOutputStreamAsString();

КонецФункции // ПрочитатьПотокВыводаКакСтроку()

// получает даные из потока вывода как двоичные данные
//
// Возвращаемое значение:
//   ДвоичныеДанные   - данные из потока вывода
//
Функция ПрочитатьПотокВыводаКакДвоичныеДанные() Экспорт

	Возврат Base64Значение(COMОбъектКомандаSSH.ReadOutputStreamAsBinaryData());	

КонецФункции // ПрочитатьПотокВыводаКакДвоичныеДанные()
 
// Возвращает данные из расширенного потока вывода как строку
//
// Возвращаемое значение:
//   Строка   - данные из расширенного потока вывода как строка
//
Функция ПрочитатьРасширенныйПотокВыводаКакСтроку() Экспорт

	Возврат COMОбъектКомандаSSH.ReadExtendedOutputStreamAsString();

КонецФункции // ПрочитатьРасширенныйПотокВыводаКакСтроку()
 
// получает данные из расширенного потока вывода в виде строки
//
// Возвращаемое значение:
//   Строка   - данные из расширенного потока вывода в виде строки
//
Функция ПрочитатьРасширеныйПотокВыводаКакДвоичныеДанные() Экспорт

	Возврат Base64Значение(COMОбъектКомандаSSH.ReadExtendedOutputStreamAsBinaryData());	

КонецФункции // ПрочитатьРасширеныйПотокВыводаКакДвоичныеДанные()
 
// Выполняет команду
//
// Возвращаемое значение:
//   Строка   - результат выполнения
//
Функция ВыполнитьКоманду() Экспорт

	Возврат COMОбъектКомандаSSH.Execute();	

КонецФункции // ВыполнитьКоманду()
 
#КонецОбласти

