#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
	УстановитьПривилегированныйРежим(Истина);
	Справочники.УчетныеДанныеАИТП.УстановитьПароль(ТекущийОбъект.Ссылка, Пароль);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьПароль(Команда)
	
	#Если ВебКлиент Тогда
	 	НачатьПодключениеРасширенияРаботыСФайлами(
	 		Новый ОписаниеОповещения("ОбработчикПодключитьРасширениеРаботыСФайлами", ЭтаФорма, Неопределено)
	    	);
	#Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтаФорма);
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		
		НачатьПомещениеФайлов(ОписаниеОповещения, , ДиалогОткрытияФайла, Истина, УникальныйИдентификатор);
	#КонецЕсли	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработчикПодключитьРасширениеРаботыСФайлами(Подключено, ДополнительныеПараметры) Экспорт
	
	Если Не Подключено Тогда
		
		НачатьУстановкуРасширенияРаботыСФайлами(Новый ОписаниеОповещения("ОбработатьРезультатУстановкиРасширенияРаботыСФайлами", ЭтаФорма, Неопределено));
		
	Иначе
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтаФорма);
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		
		НачатьПомещениеФайлов(ОписаниеОповещения, , ДиалогОткрытияФайла, Истина, УникальныйИдентификатор);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатУстановкиРасширенияРаботыСФайлами(ДополнительныеПараметры) Экспорт
	

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайла(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт

    Если ПомещенныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Для каждого ПереданныйФайл Из ПомещенныеФайлы Цикл
		
		ПутьКФайлу = ПереданныйФайл.Имя;
        Адрес = ПереданныйФайл.Хранение;
		Данные = ПолучитьИзВременногоХранилища(Адрес);
		Пароль = ПолучитьСтрокуИзДвоичныхДанных(Данные);
		
	КонецЦикла;
    
КонецПроцедуры // ()

#КонецОбласти
